In [2]:
from sqlalchemy import create_engine
from sql_pass import password
import matplotlib.pyplot as plt
import psycopg2  
import pandas as pd

In [3]:
engine = create_engine("postgresql://postgres:{password}@localhost:5432/Employee_db".format(password=password))
conn = engine.connect()

In [4]:
salaries_df = pd.read_sql('select * from salaries', conn)
salaries_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [5]:
salaries = salaries_df['salary']

In [ ]:
plt.hist(salaries)
plt.xlabel('Salary')
plt.ylabel('Employees Number')
plt.show()